[Timeout] BlockStatement
src/app.js:4:35
 import express from "express";
 const app = express();
 
-app.get("/health", (_req, res) => {
-  res.json({ ok: true, ts: Date.now() });
-});
+app.get("/health", (_req, res) => {});
 
 app.get("/hello", (_req, res) => {

[Killed] BooleanLiteral
src/app.js:5:18
 const app = express();
 
 app.get("/health", (_req, res) => {
-  res.json({ ok: true, ts: Date.now() });
+  res.json({ ok: false, ts: Date.now() });
 });
 
killedBy: api health returns ok
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] BlockStatement
src/app.js:8:34
   res.json({ ok: true, ts: Date.now() });
 });
 
-app.get("/hello", (_req, res) => {
-  res.json({ msg: "world" });
-});
+app.get("/hello", (_req, res) => {});
 
 export default app;
