[Survived] ConditionalExpression
src/index.js:2:14
 import app from "./app.js";
-const port = process.env.PORT || 3000;
+const port = true;
 app.listen(port, () => {
   console.log(`server up on ${port}`);

[Survived] ConditionalExpression
src/index.js:2:14
 import app from "./app.js";
-const port = process.env.PORT || 3000;
+const port = false;
 app.listen(port, () => {
   console.log(`server up on ${port}`);

[Survived] BlockStatement
src/index.js:3:24
 import app from "./app.js";
 const port = process.env.PORT || 3000;
-app.listen(port, () => {
-  console.log(`server up on ${port}`);
-});
+app.listen(port, () => {});
 

[Survived] StringLiteral
src/index.js:4:15
 import app from "./app.js";
 const port = process.env.PORT || 3000;
 app.listen(port, () => {
-  console.log(`server up on ${port}`);
+  console.log(``);
 });
 
